// Name: Remotely Query Login Sessions - Network
// Description: Checks for execution of MITRE ATT&CK T0000
// Severity: High
// QueryFrequency: 1h
// QueryPeriod: 1h
// AlertTriggerThreshold: 1
//
// DataSource: #Defender ATP (Defender for Endpoint)
//
// Tactics: #Discovery
//
DeviceNetworkEvents
| where ActionType == "ConnectionSuccess" and InitiatingProcessCommandLine contains "qwinsta.exe"