// Name: Credential Dumping PS
// Description: Checks for execution of MITRE ATT&CK T1003
// Severity: High
// QueryFrequency: 1h
// QueryPeriod: 1h
// AlertTriggerThreshold: 1
//
// DataSource: #Defender ATP (Defender for Endpoint)
//
// Tactics: #Credential Access
//
//
DeviceProcessEvents
| where ActionType == "ProcessCreated" and ProcessCommandLine contains "Invoke-Mimikatz -DumpCreds"
or ProcessCommandLine contains "gsecdump -a"
or ProcessCommandLine contains "wce -o"
or ProcessCommandLine contains "procdump -ma lsass.exe"
or ProcessCommandLine contains "ntdsutil*ac i ntds*ifm*create full"