// Name: Credentials in Registry
// Description: Checks for execution of MITRE ATT&CK T1214
// Severity: High
// QueryFrequency: 1h
// QueryPeriod: 1h
// AlertTriggerThreshold: 1
//
// DataSource: ##Defender ATP (Defender for Endpoint)
//
// Tactics: #Credential Access
//
//
DeviceFileEvents
| where ActionType == "FileCreated" and InitiatingProcessCommandLine contains "net accounts"
or InitiatingProcessCommandLine contains "net accounts \\/domain"