// Name: Credentials in Registry
// Description: Checks for execution of MITRE ATT&CK T1214
// Severity: High
// QueryFrequency: 1h
// QueryPeriod: 1h
// AlertTriggerThreshold: 1
//
// DataSource: ##Defender ATP (Defender for Endpoint)
//
// Tactics: #Credential Access
//
//
DeviceProcessEvents
| where ActionType == "ProcessCreated" and ProcessCommandLine contains "reg query HKLM \\/f password \\/t REG_SZ \\/s"
or ProcessCommandLine contains "reg query HKCU \\/f password \\/t REG_SZ \\/s"
or ProcessCommandLine contains "Get-UnattendedInstallFile"
or ProcessCommandLine contains "Get-Webconfig"
or ProcessCommandLine contains "Get-ApplicationHost"
or ProcessCommandLine contains "Get-SiteListPassword"
or ProcessCommandLine contains "Get-CachedGPPPassword"
or ProcessCommandLine contains "Get-RegistryAutoLogon"